# Даны два числа a и b. Найти их среднее арифметическое: (a + b) / 2.

a = float(input("Введите число a: "))
b = float(input("Введите число b: "))

average = (a + b) / 2

print("Среднее арифметическое:", average)